index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-23 dom 21:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Awesome Nintendo 3DS</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Awesome Nintendo 3DS
<br />
<span class="subtitle"><i>List of great things for Nintendo 3DS. It tries to contain pointers to all the most important, practical and cool things.</i></span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga999071">Media</a>
<ul>
<li><a href="#org909ee1e">Music</a>
<ul>
<li><a href="#orgb229869">LimePlayer3DS</a></li>
<li><a href="#org577475c">MadCitrus</a></li>
<li><a href="#org0c67fb6">ctrmus - Another 3DS Music Player</a></li>
<li><a href="#org692643a">tangerine</a></li>
</ul>
</li>
<li><a href="#org1b350c9">Video</a>
<ul>
<li><a href="#orgc329dac">ThirdTube</a></li>
<li><a href="#org39c9c9a">ThirdTube-NL</a></li>
<li><a href="#org96b05cd">ThirdTube-DE</a></li>
<li><a href="#orgd6a7b43">ThirdTube-FR</a></li>
<li><a href="#org96ae217">ThirdTube-ES</a></li>
<li><a href="#org0782f31">Video<sub>player</sub><sub>for</sub><sub>3DS</sub></a></li>
</ul>
</li>
<li><a href="#org8e8c7b6">Streaming</a>
<ul>
<li><a href="#org6958c99">TO 3ds</a></li>
<li><a href="#orgbf190f4">FROM 3ds</a></li>
</ul>
</li>
<li><a href="#orgc263ff5">Reading</a></li>
</ul>
</li>
<li><a href="#org620c4c4">Emulators</a>
<ul>
<li><a href="#orgfa16c09">NES</a>
<ul>
<li><a href="#org1347bc9">emus3ds</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org37d4e5e">Games</a>
<ul>
<li><a href="#orgbf2f6a1">Super Mario Odyssey 3ds Demake&#xa0;&#xa0;&#xa0;<span class="tag"><span class="deprecated">deprecated</span>&#xa0;<span class="open">open</span>&#xa0;<span class="anti_feature">anti_feature</span></span></a></li>
</ul>
</li>
<li><a href="#org99b928e">Libraries</a>
<ul>
<li><a href="#org167cd83">Brew.js&#xa0;&#xa0;&#xa0;<span class="tag"><span class="javascript">javascript</span></span></a></li>
<li><a href="#org68ce195">CTRJS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="javascript">javascript</span></span></a></li>
</ul>
</li>
<li><a href="#org4baa222">Store Fronts</a>
<ul>
<li><a href="#orgc942f6f">Universal Updater</a></li>
<li><a href="#org3fd01f2">hShop</a></li>
<li><a href="#org982ef4e">Ghost eShop</a></li>
</ul>
</li>
<li><a href="#orge262980">Game Engines</a>
<ul>
<li><a href="#orgd4092b2">Godot 2.x&#xa0;&#xa0;&#xa0;<span class="tag"><span class="godot_2">godot_2</span>&#xa0;<span class="open">open</span></span></a></li>
<li><a href="#org411673d">Godot 4.x&#xa0;&#xa0;&#xa0;<span class="tag"><span class="godot_4">godot_4</span>&#xa0;<span class="open">open</span></span></a></li>
<li><a href="#org97a1f98">Unity for 3ds</a></li>
<li><a href="#orgb3be885">LOVEPotion&#xa0;&#xa0;&#xa0;<span class="tag"><span class="open">open</span></span></a></li>
<li><a href="#org03fa469">SixEngine&#xa0;&#xa0;&#xa0;<span class="tag"><span class="proprietary">proprietary</span></span></a></li>
<li><a href="#org7918a8d">SmileBasic&#xa0;&#xa0;&#xa0;<span class="tag"><span class="smilebasic">smilebasic</span>&#xa0;<span class="proprietary">proprietary</span></span></a></li>
<li><a href="#orgcd71527">RPGMaker FES (+Player!)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="proprietary">proprietary</span></span></a>
<ul>
<li><a href="#orgc4239bc">A word of Warning</a></li>
</ul>
</li>
<li><a href="#org1f514ea">EasyRPG&#xa0;&#xa0;&#xa0;<span class="tag"><span class="open">open</span></span></a></li>
<li><a href="#org56cae5d">CTREngine?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="vapourware">vapourware</span></span></a></li>
<li><a href="#orgbbf88a1">Headcannon Game Engine&#xa0;&#xa0;&#xa0;<span class="tag"><span class="deprecated">deprecated</span>&#xa0;<span class="proprietary">proprietary</span></span></a></li>
<li><a href="#orgb112a45">Octave&#xa0;&#xa0;&#xa0;<span class="tag"><span class="open">open</span>&#xa0;<span class="multiplatform">multiplatform</span></span></a></li>
</ul>
</li>
<li><a href="#orgaded951">Unistores</a>
<ul>
<li><a href="#org4b3d16f">Universal-DB</a></li>
<li><a href="#org82c1d7d">Minecraft 3ds</a></li>
</ul>
</li>
<li><a href="#orge953c9e">Tools</a>
<ul>
<li><a href="#orga0ec185">UnistoreServer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="open">open</span></span></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga999071" class="outline-2">
<h2 id="orga999071">Media</h2>
<div class="outline-text-2" id="text-orga999071">
</div>
<div id="outline-container-org909ee1e" class="outline-3">
<h3 id="org909ee1e">Music</h3>
<div class="outline-text-3" id="text-org909ee1e">
</div>
<div id="outline-container-orgb229869" class="outline-4">
<h4 id="orgb229869"><a href="https://github.com/oreo639/LimePlayer3DS">LimePlayer3DS</a></h4>
<div class="outline-text-4" id="text-orgb229869">
<p>
3ds version of LimePlayer, Plays Mp3, Wav, Flac, Midi, Xmi, Mus, Hmi, Hmp, Ogg vorbis, and Opus music (alpha version) -
</p>
</div>
</div>
<div id="outline-container-org577475c" class="outline-4">
<h4 id="org577475c"><a href="https://github.com/Hayleia/ctrmus/releases">MadCitrus</a></h4>
<div class="outline-text-4" id="text-org577475c">
<p>
Can play PCM, WAV, AIFF, FLAC, Opus, Vorbis, MP3, FFMPEG format music. Improved version of ctrmus.
</p>
</div>
</div>
<div id="outline-container-org0c67fb6" class="outline-4">
<h4 id="org0c67fb6"><a href="https://github.com/deltabeard/ctrmus/releases">ctrmus - Another 3DS Music Player</a></h4>
<div class="outline-text-4" id="text-org0c67fb6">
<p>
Plays music in PCM WAV, AIFF, FLAC, Opus, Vorbis and MP3 formats.
</p>
</div>
</div>
<div id="outline-container-org692643a" class="outline-4">
<h4 id="org692643a"><a href="https://github.com/tesnos/tangerine">tangerine</a></h4>
<div class="outline-text-4" id="text-org692643a">
<p>
Can play music in wav, flac, and mp3 format
</p>
</div>
</div>
</div>
<div id="outline-container-org1b350c9" class="outline-3">
<h3 id="org1b350c9">Video</h3>
<div class="outline-text-3" id="text-org1b350c9">
</div>
<div id="outline-container-orgc329dac" class="outline-4">
<h4 id="orgc329dac"><a href="https://github.com/windows-server-2003/ThirdTube">ThirdTube</a></h4>
<div class="outline-text-4" id="text-orgc329dac">
<p>
Unofficial YouTube client app. -
</p>
</div>
</div>
<div id="outline-container-org39c9c9a" class="outline-4">
<h4 id="org39c9c9a"><a href="https://github.com/FreakinSoftMania/ThirdTube-NL">ThirdTube-NL</a></h4>
<div class="outline-text-4" id="text-org39c9c9a">
<p>
Dutch translation of Thirdtube
</p>
</div>
</div>
<div id="outline-container-org96b05cd" class="outline-4">
<h4 id="org96b05cd"><a href="https://github.com/Frocat64/ThirdTube-DE">ThirdTube-DE</a></h4>
<div class="outline-text-4" id="text-org96b05cd">
<p>
German translation of Thirdtube
</p>
</div>
</div>
<div id="outline-container-orgd6a7b43" class="outline-4">
<h4 id="orgd6a7b43"><a href="https://github.com/cooolgamer/ThirdTube-FR">ThirdTube-FR</a></h4>
<div class="outline-text-4" id="text-orgd6a7b43">
<p>
French translation of Thirdtube
</p>
</div>
</div>
<div id="outline-container-org96ae217" class="outline-4">
<h4 id="org96ae217"><a href="https://github.com/JustSofter/ThirdTube-ES">ThirdTube-ES</a></h4>
<div class="outline-text-4" id="text-org96ae217">
<p>
Spanish translation of Thirdtube
</p>
</div>
</div>
<div id="outline-container-org0782f31" class="outline-4">
<h4 id="org0782f31"><a href="https://github.com/Core-2-Extreme/Video_player_for_3DS">Video<sub>player</sub><sub>for</sub><sub>3DS</sub></a></h4>
</div>
</div>
<div id="outline-container-org8e8c7b6" class="outline-3">
<h3 id="org8e8c7b6">Streaming</h3>
<div class="outline-text-3" id="text-org8e8c7b6">
</div>
<div id="outline-container-org6958c99" class="outline-4">
<h4 id="org6958c99">TO 3ds</h4>
<div class="outline-text-4" id="text-org6958c99">
</div>
<ul class="org-ul">
<li><a id="org581eabf"></a><a href="https://github.com/zoeyjodon/moonlight-N3DS">Moonlight</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="new">new</span></span><br />
<div class="outline-text-5" id="text-org581eabf">
<p>
Gamestream client for the New 3DS 
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgbf190f4" class="outline-4">
<h4 id="orgbf190f4">FROM 3ds</h4>
<div class="outline-text-4" id="text-orgbf190f4">
</div>
<ul class="org-ul">
<li><a id="orga3b0cdd"></a><a href="https://github.com/RattletraPM/Snickerstream">Snickerstream</a><br />
<div class="outline-text-5" id="text-orga3b0cdd">
<p>
Unified NTR and HzMod streaming client for the 3DS
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc263ff5" class="outline-3">
<h3 id="orgc263ff5">Reading</h3>
<div class="outline-text-3" id="text-orgc263ff5">
<p>
Is there nothing at the moment?
</p>
</div>
</div>
</div>
<div id="outline-container-org620c4c4" class="outline-2">
<h2 id="org620c4c4">Emulators</h2>
<div class="outline-text-2" id="text-org620c4c4">
</div>
<div id="outline-container-orgfa16c09" class="outline-3">
<h3 id="orgfa16c09">NES</h3>
<div class="outline-text-3" id="text-orgfa16c09">
</div>
<div id="outline-container-org1347bc9" class="outline-4">
<h4 id="org1347bc9"><a href="https://github.com/bubble2k16/emus3ds">emus3ds</a></h4>
<div class="outline-text-4" id="text-org1347bc9">
<p>
Nintendo Entertainment System(NES,Famicom in Japan, Hyundai Comboy in Korea) emulator
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org37d4e5e" class="outline-2">
<h2 id="org37d4e5e">Games</h2>
<div class="outline-text-2" id="text-org37d4e5e">
<p>
This section will of course only contain homebrew games not available on the Universal Updater
</p>
</div>
<div id="outline-container-orgbf2f6a1" class="outline-3">
<h3 id="orgbf2f6a1"><a href="https://github.com/Team8Alpha/smo3ds">Super Mario Odyssey 3ds Demake</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="deprecated">deprecated</span>&#xa0;<span class="open">open</span>&#xa0;<span class="anti_feature">anti_feature</span></span></h3>
</div>
</div>

<div id="outline-container-org99b928e" class="outline-2">
<h2 id="org99b928e">Libraries</h2>
<div class="outline-text-2" id="text-org99b928e">
</div>
<div id="outline-container-org167cd83" class="outline-3">
<h3 id="org167cd83"><a href="https://github.com/XorTroll/Brew.js">Brew.js</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="javascript">javascript</span></span></h3>
<div class="outline-text-3" id="text-org167cd83">
<p>
C++ high-level Javascript API for Nintendo homebrew
</p>
</div>
</div>
<div id="outline-container-org68ce195" class="outline-3">
<h3 id="org68ce195"><a href="https://github.com/Symbitic/CTRJS">CTRJS</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="javascript">javascript</span></span></h3>
<div class="outline-text-3" id="text-org68ce195">
<p>
Native Javascript Interpreter for the Nintendo 3DS.
</p>
</div>
</div>
</div>

<div id="outline-container-org4baa222" class="outline-2">
<h2 id="org4baa222">Store Fronts</h2>
<div class="outline-text-2" id="text-org4baa222">
<p>
A list of alternative storefronts for the Nintendo 3DS.
</p>
</div>
<div id="outline-container-orgc942f6f" class="outline-3">
<h3 id="orgc942f6f"><a href="https://github.com/Universal-Team/Universal-Updater">Universal Updater</a></h3>
</div>
<div id="outline-container-org3fd01f2" class="outline-3">
<h3 id="org3fd01f2">hShop</h3>
</div>
<div id="outline-container-org982ef4e" class="outline-3">
<h3 id="org982ef4e">Ghost eShop</h3>
</div>
</div>

<div id="outline-container-orge262980" class="outline-2">
<h2 id="orge262980">Game Engines</h2>
<div class="outline-text-2" id="text-orge262980">
</div>
<div id="outline-container-orgd4092b2" class="outline-3">
<h3 id="orgd4092b2"><a href="https://github.com/SeleDreams/godot-2-3ds">Godot 2.x</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="godot_2">godot_2</span>&#xa0;<span class="open">open</span></span></h3>
</div>

<div id="outline-container-org411673d" class="outline-3">
<h3 id="org411673d"><a href="https://github.com/SeleDreams/godot-4-3ds">Godot 4.x</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="godot_4">godot_4</span>&#xa0;<span class="open">open</span></span></h3>
</div>
<div id="outline-container-org97a1f98" class="outline-3">
<h3 id="org97a1f98">Unity for 3ds</h3>
<div class="outline-text-3" id="text-org97a1f98">
<p>
We can't point to the binary for obvious reasons, but at least this'll help you look for it ;)
</p>

<p>
Usually not fit for old3ds, but seems like it can be optimized with very strong tweaks.
</p>
</div>
</div>
<div id="outline-container-orgb3be885" class="outline-3">
<h3 id="orgb3be885"><a href="https://github.com/lovebrew/LovePotion">LOVEPotion</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="open">open</span></span></h3>
</div>
<div id="outline-container-org03fa469" class="outline-3">
<h3 id="org03fa469"><a href="https://www.sixengine.com">SixEngine</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="proprietary">proprietary</span></span></h3>
</div>
<div id="outline-container-org7918a8d" class="outline-3">
<h3 id="org7918a8d"><a href="http://smilebasic.com/en/">SmileBasic</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="smilebasic">smilebasic</span>&#xa0;<span class="proprietary">proprietary</span></span></h3>
<div class="outline-text-3" id="text-org7918a8d">
<p>
Allows the player to make tiny games in BASIC, to play on the 3ds. While not exactly a game engine, but more like a game interpreter, it might still scratch your Game-making itch.
</p>
</div>
</div>
<div id="outline-container-orgcd71527" class="outline-3">
<h3 id="orgcd71527">RPGMaker FES (+Player!)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="proprietary">proprietary</span></span></h3>
<div class="outline-text-3" id="text-orgcd71527">
<p>
3ds version of RPG Maker FES. while not suited for proper development, this might also scratch your game development itch.
</p>
</div>
<div id="outline-container-orgc4239bc" class="outline-4">
<h4 id="orgc4239bc">A word of Warning</h4>
<div class="outline-text-4" id="text-orgc4239bc">
<p>
To play games, you will need the RPGMaker FES Player!
</p>
</div>
</div>
</div>
<div id="outline-container-org1f514ea" class="outline-3">
<h3 id="org1f514ea"><a href="https://easyrpg.org/">EasyRPG</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="open">open</span></span></h3>
<div class="outline-text-3" id="text-org1f514ea">
<p>
While the 3ds only has the player available, you should be able to develop for this target, then pack the files properly, and get a working game. I have not personally tested this so results may vary.
</p>
</div>
</div>
<div id="outline-container-org56cae5d" class="outline-3">
<h3 id="org56cae5d">CTREngine?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="vapourware">vapourware</span></span></h3>
<div class="outline-text-3" id="text-org56cae5d">
<p>
Unknown game engine for the 3ds. supposedly used for a Wind Waker demake.
</p>
</div>
</div>
<div id="outline-container-orgbbf88a1" class="outline-3">
<h3 id="orgbbf88a1"><a href="https://www.gamebrew.org/wiki/Headcannon_Game_Engine_3DS">Headcannon Game Engine</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="deprecated">deprecated</span>&#xa0;<span class="proprietary">proprietary</span></span></h3>
<div class="outline-text-3" id="text-orgbbf88a1">
<p>
HCGE, also known as Headcannon Game Engine, is a multiplatform game engine that can be used to create retro-style 2D games. Supported platforms include Windows, Linux, MacOSX, PSP (CFW), Wii (Homebrew Channel), GP2XWiz, GCWZero, and 3DS (Homebrew Launcher).
</p>
</div>
</div>
<div id="outline-container-orgb112a45" class="outline-3">
<h3 id="orgb112a45"><a href="https://github.com/mholtkamp/octave">Octave</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="open">open</span>&#xa0;<span class="multiplatform">multiplatform</span></span></h3>
</div>
</div>
<div id="outline-container-orgaded951" class="outline-2">
<h2 id="orgaded951">Unistores</h2>
<div class="outline-text-2" id="text-orgaded951">
</div>
<div id="outline-container-org4b3d16f" class="outline-3">
<h3 id="org4b3d16f"><a href="https://db.universal-team.net/">Universal-DB</a></h3>
</div>
<div id="outline-container-org82c1d7d" class="outline-3">
<h3 id="org82c1d7d"><a href="https://www.minecraft3ds.net/">Minecraft 3ds</a></h3>
<div class="outline-text-3" id="text-org82c1d7d">
<p>
Unistore focused on the collection of mods for the New3ds Version of Minecraft.
</p>
</div>
</div>
</div>
<div id="outline-container-orge953c9e" class="outline-2">
<h2 id="orge953c9e">Tools</h2>
<div class="outline-text-2" id="text-orge953c9e">
</div>
<div id="outline-container-orga0ec185" class="outline-3">
<h3 id="orga0ec185">UnistoreServer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="open">open</span></span></h3>
<div class="outline-text-3" id="text-orga0ec185">
<p>
Coming soon!
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-06-23 dom 21:31</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
